let CVE = "CVE-2024-xyz"; // Add your CVEid here
DeviceTvmSoftwareVulnerabilities
| where CveId == CVE
| summarize VulnerableDevices = make_set(DeviceName) by CveId
| join DeviceTvmSoftwareVulnerabilitiesKB on CveId
| extend TotalDevices = array_length(VulnerableDevices)
| project TotalDevices, VulnerabilityDescription, VulnerableDevices, CveId, VulnerabilitySeverityLevel, CvssScore
